cf/Enums/ReportsTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ReportsTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Internal</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Additional</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>External</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DeleteReport</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DeleteCustom</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/ReportsVariants.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ReportsVariants</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Report</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.AdditionalReportsAndDataProcessors</v8:Type>
						<v8:Type>cfg:CatalogRef.MetadataObjectIDs</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReportType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ReportsTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VariantKey</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PredefinedVariant</Name>
					<Comment>Configuration option</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.PredefinedReportsVariants</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>User</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ForAuthorOnly</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VisibleByDefault</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VisibleByDefaultIsOverridden</Name>
					<Comment>If True, then the VisibleByDefault check box is replaced with a similar check box value of the predefined report option.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Settings</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SettingsHash</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FieldNames</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ParametersAndFiltersNames</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Definition</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteObjectKey</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteObjectPresentation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Placement</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Use</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Subsystem</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.MetadataObjectIDs</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Important</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SeeAlso</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DeleteFixed</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DeleteName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DeleteSubsystem</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>DeleteQuickAccessExceptions</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>DeleteUser</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Users</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>MultilingualValuesReports</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>LanguageKey</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Description</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Definition</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/CommonModules/ReportsVariantsClient/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// "Reports variants" subsystem (client).
// 
// Executed on client.
////////////////////////////////////////////////////////////////////////////////

#Region ProgramInterface

// Opens the reports panel. Used in module of common command.
//
// Parameters:
//   PathToSubsystem - String - Section name or path to the subsystem for which the report panel is opened.
//       It is set in format: "SectionName[.NestedSubsystem1Name][.NestedSubsystems2Name][...]".
//       NB! Section must be described in ReportsVariantsOverridable.DetermineSectionsWithReportsVariants.
//   CommandExecuteParameters - CommandExecuteParameters - It is passed "as is" from the handler command parameters.
//
Procedure ShowReportsPanel(PathToSubsystem, CommandExecuteParameters, Delete_Title = "") Export
	ParametersForm = New Structure("PathToSubsystem", PathToSubsystem);
	WindowForm = ?(CommandExecuteParameters = Undefined, Undefined, CommandExecuteParameters.Window);
	OpenForm("CommonForm.ReportsPanel", ParametersForm, , PathToSubsystem, WindowForm);
EndProcedure

// Opens the location setup dialog of several variants in sections.
//   It is recommended to perform checks before the call.
//
// Parameters:
//   OptionsArray - Array from CatalogRef.ReportsVariants - Report variants for which the dialog is opened.
//   AdditionalParameters (*) Optional.
//   Owner - ManagedForm - Optional. Used only to block the owner window.
//
Procedure OpenPlacingVariantsInSectionsDialog(OptionsArray, AdditionalParameters = Undefined, Owner = Undefined) Export
	
	If TypeOf(OptionsArray) <> Type("Array") OR OptionsArray.Count() < 1 Then
		ShowMessageBox(, NStr("en='Select report variants to be placed in sections.';ru='Выберите варианты отчетов, которые необходимо разместить в разделах.'"));
		Return;
	EndIf;
	
	OpenParameters = New Structure("OptionsArray, AdditionalParameters", OptionsArray, AdditionalParameters);
	OpenForm("Catalog.ReportsVariants.Form.PlacementInSections", OpenParameters, Owner);
	
EndProcedure

// Opens the user settings reset dialog of selected report variants.
//   It is recommended to perform checks before the call.
//
// Parameters:
//   OptionsArray - Array from CatalogRef.ReportsVariants - Report variants for which the dialog is opened.
//   Owner - ManagedForm - Optional. Used only to block the owner window.
//
Procedure OpenUsersSettingsResetDialog(OptionsArray, Owner = Undefined) Export
	
	If TypeOf(OptionsArray) <> Type("Array") OR OptionsArray.Count() < 1 Then
		ShowMessageBox(, NStr("en='Select report variants for which it is required to reset the custom settings.';ru='Выберите варианты отчетов, для которых необходимо сбросить пользовательские настройки.'"));
		Return;
	EndIf;
	
	OpenParameters = New Structure;
	OpenParameters.Insert("OptionsArray", OptionsArray);
	OpenForm("Catalog.ReportsVariants.Form.ResetUserSettings", OpenParameters, Owner);
	
EndProcedure

// Opens the location settings reset dialog of selected application report variants.
//   It is recommended to perform checks before the call.
//
// Parameters:
//   OptionsArray - Array from CatalogRef.ReportsVariants - Report variants for which the dialog is opened.
//   Owner - ManagedForm - Optional. Used only to block the owner window.
//
Procedure OpenDirectoryPropertiesResetDialog(OptionsArray, Owner = Undefined) Export
	
	If TypeOf(OptionsArray) <> Type("Array") OR OptionsArray.Count() < 1 Then
		ShowMessageBox(, NStr("en='Select the application report variants which location settings are to be reset.';ru='Выберите варианты отчетов программы, для которых необходимо сбросить настройки размещения.'"));
		Return;
	EndIf;
	
	OpenParameters = New Structure;
	OpenParameters.Insert("OptionsArray", OptionsArray);
	OpenForm("Catalog.ReportsVariants.Form.ResetLocationSettings", OpenParameters, Owner);
	
EndProcedure

// Notifies the public report panels, lists and items forms about changes.
//
// Parameters:
//   Parameter - Arbitrary - Optional. Any necessary data can be transferred.
//   Source - Arbitrary - Optional. The event source. For example you can pass another form.
//
Procedure OpenFormsRefresh(Parameter = Undefined, Source = Undefined) Export
	
	Notify(ReportsVariantsClientServer.EventNameOptionChanging(), Parameter, Source);
	
EndProcedure

#EndRegion

#Region ServiceProgramInterface

// Opens a report form.
//
// Parameters:
//   ReportParameters - Structure - Main information about the report necessary for its opening.
//   FormParameters - Structure - Opening parameters of the report form.
//
Procedure Open(ReportParameters, FormParameters, Owner) Export
	
	Uniqueness = ReportParameters.FullName;
	If ValueIsFilled(ReportParameters.VariantKey) Then
		Uniqueness = Uniqueness + "/VariantKey." + ReportParameters.VariantKey;
	EndIf;
	
	If FormParameters = Undefined Then
		FormParameters = New Structure;
	EndIf;
	
	FormParameters.Insert("VariantKey", ReportParameters.VariantKey);
	FormParameters.Insert("PrintParametersKey", Uniqueness);
	FormParameters.Insert("WindowOptionsKey", Uniqueness);
	
	OpenForm(ReportParameters.FullName + ".Form", FormParameters, Owner, Uniqueness);
	
EndProcedure

#EndRegion

#Region ServiceProceduresAndFunctions

// Opens a report form.
//
// Parameters:
//   Form - ManagedForm - Form where the report is opened from.
//
Procedure OpenReportOption(Form) Export
	If Form.FormName = "Catalog.ReportsVariants.Form.ListForm" Then
		Variant = Form.Items.List.CurrentData;
	ElsIf Form.FormName = "Catalog.ReportsVariants.Form.ItemForm" Then
		Variant = Form.Object;
	Else
		Return;
	EndIf;
	
	If Variant = Undefined OR Variant.Ref.IsEmpty() Then
		
		ShowMessageBox(, NStr("en='Select report variant.';ru='Выберите вариант отчета.'"));
		
	ElsIf Variant.ReportType = PredefinedValue("Enum.ReportsTypes.External") Then
		
		ShowMessageBox(, NStr("en='External report variant can be opened only from the report form.';ru='Вариант внешнего отчета можно открыть только из формы отчета.'"));
		
	ElsIf Variant.ReportType = PredefinedValue("Enum.ReportsTypes.Additional") Then
		
		OpenParameters = New Structure("Ref, Report, KeyVariant");
		FillPropertyValues(OpenParameters, Variant);
		OpenAdditionalReportVariants(OpenParameters);
		
	Else
		
		If Form.FormName = "Catalog.ReportsVariants.Form.ListForm" Then
			ReportName = Variant.ReportName;
		Else
			ReportName = Form.ReportName;
		EndIf;
		
		Uniqueness = "Report." + ReportName;
		If ValueIsFilled(Variant.VariantKey) Then
			Uniqueness = Uniqueness + "/VariantKey." + Variant.VariantKey;
		EndIf;
		
		OpenParameters = New Structure;
		OpenParameters.Insert("VariantKey", Variant.VariantKey);
		OpenParameters.Insert("PrintParametersKey", Uniqueness);
		OpenParameters.Insert("WindowOptionsKey", Uniqueness);
		
		OpenForm("Report." + ReportName + ".Form", OpenParameters, Undefined, Uniqueness);
		
	EndIf;
EndProcedure

// Opens the settings form (in particular location) of the report variant.
Procedure ShowReportSettings(VariantRef) Export
	FormParameters = New Structure;
	FormParameters.Insert("LocationSetup", True);
	FormParameters.Insert("Key", VariantRef);
	OpenForm("Catalog.ReportsVariants.ObjectForm", FormParameters);
EndProcedure

// Procedure serves the event of SubsystemsTree attribute in editing forms.
Procedure SubsystemsTreeUsingOnChange(Form, Item) Export
	TreeRow = Form.Items.SubsystemsTree.CurrentData;
	If TreeRow = Undefined Then
		Return;
	EndIf;
	
	// Root line pass
	If TreeRow.Priority = "" Then
		TreeRow.Use = 0;
		Return;
	EndIf;
	
	If TreeRow.Use = 2 Then
		TreeRow.Use = 0;
	EndIf;
	
	TreeRow.Modified = True;
EndProcedure

// Procedure serves the event of SubsystemsTree attribute in editing forms.
Procedure SubsystemsTreeImportanceOnChange(Form, Item) Export
	TreeRow = Form.Items.SubsystemsTree.CurrentData;
	If TreeRow = Undefined Then
		Return;
	EndIf;
	
	// Root line pass
	If TreeRow.Priority = "" Then
		TreeRow.Importance = "";
		Return;
	EndIf;
	
	If TreeRow.Importance <> "" Then
		TreeRow.Use = 1;
	EndIf;
	
	TreeRow.Modified = True;
EndProcedure

// Analog CommonUseClient.ShowMultiLineTexrEditingFrom running for 1 call.
//   Unlike CommonUseClient.ShowCommentEditingForm allows to set own
//   title and works with attributes of tables.
//
Procedure EditMultilineText(FormOrHandler, EditText, PropsOwner, AttributeName, Val Title = "") Export
	
	If IsBlankString(Title) Then
		Title = NStr("en='Note';ru='Примечание'");
	EndIf;
	
	SourceParameters = New Structure;
	SourceParameters.Insert("FormOrHandler", FormOrHandler);
	SourceParameters.Insert("PropsOwner",  PropsOwner);
	SourceParameters.Insert("AttributeName",       AttributeName);
	Handler = New NotifyDescription("EditMultilinedTextEnd", ThisObject, SourceParameters);
	
	ShowInputString(Handler, EditText, Title, , True);
	
EndProcedure

// Procedure work result handler EditMultilineText.
Procedure EditMultilinedTextEnd(Text, SourceParameters) Export
	
	If TypeOf(SourceParameters.FormOrHandler) = Type("ManagedForm") Then
		Form      = SourceParameters.FormOrHandler;
		Handler = Undefined;
	Else
		Form      = Undefined;
		Handler = SourceParameters.FormOrHandler;
	EndIf;
	
	If Text <> Undefined Then
		
		If TypeOf(SourceParameters.PropsOwner) = Type("FormDataTreeItem")
			Or TypeOf(SourceParameters.PropsOwner) = Type("FormDataCollectionItem") Then
			FillPropertyValues(SourceParameters.PropsOwner, New Structure(SourceParameters.AttributeName, Text));
		Else
			SourceParameters.PropsOwner[SourceParameters.AttributeName] = Text;
		EndIf;
		
		If Form <> Undefined Then
			If Not Form.Modified Then
				Form.Modified = True;
			EndIf;
		EndIf;
		
	EndIf;
	
	If Handler <> Undefined Then
		ExecuteNotifyProcessing(Handler, Text);
	EndIf;
	
EndProcedure

////////////////////////////////////////////////////////////////////////////////
// Handlers of the conditional calls into other subsystems.

// Opens the additional report form with the specified option.
//
// Parameters:
//   Variant - Structure - Information about report variant:
//       * Ref - CatalogRef.ReportsVariants - Ref of report variant.
//       * Report - <see. Catalogs.ReportsVariants.Attributes.Report> - Ref or report name.
//       * VariantKey - String - Report variant name.
//
Procedure OpenAdditionalReportVariants(Variant) Export
	
	If CommonUseClient.SubsystemExists("StandardSubsystems.AdditionalReportsAndDataProcessors") Then
		ModuleAdditionalreportsAndDataProcessorsClient = CommonUseClient.CommonModule("AdditionalReportsAndDataProcessorsClient");
		ModuleAdditionalreportsAndDataProcessorsClient.OpenAdditionalReportVariants(Variant.Report, Variant.VariantKey);
	EndIf;
	
EndProcedure

#EndRegion
